Repository: kirinonakar/AIMediaWorker
Catalog: AIMediaWorker/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, ko_kr

# WebDavCredentialMissingMessage
source: WebDAV connection details are missing from Windows Credential Manager. Add the server again.
ja_jp: Windows資格情報マネージャーにWebDAV接続情報がありません。サーバーを再追加してください。
ko_kr: Windows 자격 증명 관리자에 WebDAV 연결 정보가 없습니다. 서버를 다시 추가하세요.

# WebDavSelectServerMessage
source: Select a server to connect
ja_jp: 接続するサーバーを選択してください
ko_kr: 연결할 서버를 선택하세요

# WebDavServerAddedMessage
source: Added {0}. Select it to connect.
ja_jp: {0}を追加しました。選択すると接続します。
ko_kr: {0} 서버를 추가했습니다. 클릭하면 연결됩니다.

# WebDavConnectingMessage
source: Connecting to {0}…
ja_jp: {0}に接続中…
ko_kr: {0} 서버에 연결 중…

# WebDavConnectedMessage
source: Connected to {0} · {1} item(s)
ja_jp: {0}に接続済み · {1}項目
ko_kr: {0} 연결됨 · 항목 {1}개

# ProviderNoModelsMessage
source: The provider returned no models. You can still enter a model id manually.
ja_jp: プロバイダーからモデルが返されませんでした。モデルIDを直接入力できます。
ko_kr: 제공자가 모델을 반환하지 않았습니다. 모델 ID를 직접 입력할 수 있습니다.

# ProviderModelsTitle
source: {0} models
ja_jp: {0}モデル
ko_kr: {0} 모델

# UseSelectedButton
source: Use selected
ja_jp: 選択項目を使用
ko_kr: 선택 항목 사용

# CachedModelsTitle
source: Cached models
ja_jp: キャッシュ済みモデル
ko_kr: 캐시된 모델

# ModelSyncCachedMessage
source: Sync failed: {0} Choose a cached model or close and type one manually.
ja_jp: 同期失敗: {0} キャッシュ済みモデルを選ぶか、閉じて直接入力してください。
ko_kr: 동기화 실패: {0} 캐시된 모델을 선택하거나 닫고 직접 입력하세요.

# ModelSyncFailedTitle
source: Model sync failed
ja_jp: モデル同期に失敗しました
ko_kr: 모델 동기화 실패

# ModelSyncManualMessage
source: {0} Enter a model id manually.
ja_jp: {0} モデルIDを直接入力してください。
ko_kr: {0} 모델 ID를 직접 입력하세요.

# CueDurationValidationMessage
source: Minimum cue duration cannot exceed maximum cue duration.
ja_jp: 字幕の最小時間は最大時間を超えられません。
ko_kr: 최소 자막 길이는 최대 자막 길이보다 클 수 없습니다.

# CrispAsrRuntimeRequiredMessage
source: CrispASR runtime directory is required.
ja_jp: CrispASRランタイムのパスが必要です。
ko_kr: CrispASR 런타임 경로가 필요합니다.

# SettingsErrorTitle
source: Settings error
ja_jp: 設定エラー
ko_kr: 설정 오류

# LanguageRestartTitle
source: Restart required
ja_jp: 再起動が必要です
ko_kr: 다시 시작 필요

# LanguageRestartMessage
source: The language change will be applied after restarting the app. Restart now?
ja_jp: 言語の変更はアプリの再起動後に適用されます。今すぐ再起動しますか？
ko_kr: 언어 변경은 앱을 다시 시작하면 적용됩니다. 지금 다시 시작하시겠습니까?

# RestartNowButton
source: Restart now
ja_jp: 今すぐ再起動
ko_kr: 지금 다시 시작

# LaterButton
source: Later
ja_jp: 後で
ko_kr: 나중에

# DeleteWebDavServerTitle
source: Delete WebDAV server
ja_jp: WebDAVサーバーを削除
ko_kr: WebDAV 서버 삭제

# DeleteWebDavServerMessage
source: Delete “{0}” and its stored credential?
ja_jp: “{0}”サーバーと保存済み資格情報を削除しますか？
ko_kr: “{0}” 서버와 저장된 자격 증명을 삭제하시겠습니까?

# DeleteButtonText
source: Delete
ja_jp: 削除
ko_kr: 삭제

# ClearApiKeyButton.Content
source: Clear stored key
ja_jp: 保存済みキーを削除
ko_kr: 저장된 키 삭제

# CredentialRemovedTitle
source: Credential removed
ja_jp: 資格情報を削除しました
ko_kr: 자격 증명 삭제됨

# CredentialRemovedMessage
source: Removed the stored key for {0}.
ja_jp: {0}の保存済みキーを削除しました。
ko_kr: {0}의 저장된 키를 삭제했습니다.

# ShowRightPanel.Text
source: Show side panel
ja_jp: サイドパネルを表示
ko_kr: 사이드 패널 표시

# ShowBottomPanel.Text
source: Show timeline panel
ja_jp: タイムラインパネルを表示
ko_kr: 타임라인 패널 표시

# SubtitleVisibility.Text
source: Show subtitles
ja_jp: 字幕を表示
ko_kr: 자막 표시

# FavoritesTab.Header
source: Favorites
ja_jp: お気に入り
ko_kr: 즐겨찾기

# AddBrowserFavorite.Text
source: Add to favorites
ja_jp: お気に入りに追加
ko_kr: 즐겨찾기에 추가

# AddWebDavFavorite.Text
source: Add to favorites
ja_jp: お気に入りに追加
ko_kr: 즐겨찾기에 추가

# OpenFavoriteButton.Label
source: Open
ja_jp: 開く
ko_kr: 열기

# RemoveSelectedFavoritesButton.Label
source: Remove from favorites
ja_jp: お気に入りから削除
ko_kr: 즐겨찾기에서 삭제

# FavoritesEmptyText.Text
source: No favorites
ja_jp: お気に入りはありません
ko_kr: 즐겨찾기가 없습니다

# AddWebDavServerMenu.Text
source: Add WebDAV server…
ja_jp: WebDAVサーバーを追加…
ko_kr: WebDAV 서버 추가…

# WebDavAddServerCommand.Label
source: Add WebDAV server
ja_jp: WebDAVサーバーを追加
ko_kr: WebDAV 서버 추가

# SettingsGeneralSection.Text
source: General
ja_jp: 一般
ko_kr: 일반

# SettingsPlaybackSection.Text
source: Playback
ja_jp: 再生
ko_kr: 재생

# SettingsSubtitleSection.Text
source: Subtitle
ja_jp: 字幕
ko_kr: 자막

# SettingsAsrSection.Text
source: Automatic speech recognition
ja_jp: 自動音声認識
ko_kr: 자동 음성 인식

# SettingsNetworkSection.Text
source: Network
ja_jp: ネットワーク
ko_kr: 네트워크

# SettingsCaptureSection.Text
source: Capture
ja_jp: キャプチャ
ko_kr: 캡처

# RightPanelExplorer
source: Explorer
ja_jp: エクスプローラー
ko_kr: 탐색기

# RightPanelPlaylist
source: Playlist
ja_jp: プレイリスト
ko_kr: 재생 목록

# RightPanelFavorites
source: Favorites
ja_jp: お気に入り
ko_kr: 즐겨찾기

# RightPanelSubtitles
source: Subtitles
ja_jp: 字幕
ko_kr: 자막

# BrowserChooseFolder.Label
source: Choose folder
ja_jp: フォルダーを選択
ko_kr: 폴더 선택

# BrowserHome.Label
source: Home folder
ja_jp: ホームフォルダー
ko_kr: 홈 폴더

# BrowserParentFolder.Label
source: Parent folder
ja_jp: 親フォルダー
ko_kr: 상위 폴더

# BrowserRefresh.Label
source: Refresh
ja_jp: 更新
ko_kr: 새로 고침

# PlaylistAddMedia.Label
source: Add media
ja_jp: メディアを追加
ko_kr: 미디어 추가

# PlaylistClear.Label
source: Clear playlist
ja_jp: リストをクリア
ko_kr: 목록 비우기

# PlaybackStatePlaying
source: Playing
ja_jp: 再生中
ko_kr: 재생 중

# PlaybackStatePaused
source: Paused
ja_jp: 一時停止
ko_kr: 일시정지

# PlaybackStateLoading
source: Loading
ja_jp: 読み込み中
ko_kr: 불러오는 중

# PlaybackStateIdle
source: Idle
ja_jp: 待機中
ko_kr: 대기

# PlaybackStateFailed
source: Playback failed
ja_jp: 再生エラー
ko_kr: 재생 오류

# PlaybackStateUninitialized
source: Not initialized
ja_jp: 未初期化
ko_kr: 초기화되지 않음

# TooltipBeginning
source: Go to beginning (Home)
ja_jp: 先頭へ移動 (Home / Backspace / Ctrl+Shift+N)
ko_kr: 처음으로 이동 (Home / Backspace / Ctrl+Shift+N)

# TooltipPreviousMedia
source: Previous media ({0})
ja_jp: 前のメディア ({0})
ko_kr: 이전 미디어 ({0})

# TooltipNextMedia
source: Next media ({0})
ja_jp: 次のメディア ({0})
ko_kr: 다음 미디어 ({0})

# TooltipSeekBackward
source: Seek backward {0:0.#}s ({1})
ja_jp: {0:0.#}秒戻る ({1})
ko_kr: {0:0.#}초 뒤로 탐색 ({1})

# TooltipSeekForward
source: Seek forward {0:0.#}s ({1})
ja_jp: {0:0.#}秒進む ({1})
ko_kr: {0:0.#}초 앞으로 탐색 ({1})

# TooltipMute
source: Mute (M)
ja_jp: ミュート (M)
ko_kr: 음소거 (M)

# TooltipVolume
source: Volume (↑ / ↓)
ja_jp: 音量 (↑ / ↓)
ko_kr: 음량 (↑ / ↓)

# TooltipPosition
source: Seek (Home / End) · Play from beginning ({0})
ja_jp: シーク (Home / End) · 先頭から再生 ({0})
ko_kr: 탐색 (Home / End) · 처음부터 재생 ({0})

# TooltipSubtitleNavigation
source: Previous: {0} · Next: {1}
ja_jp: 前: {0} · 次: {1}
ko_kr: 이전: {0} · 다음: {1}

# TooltipRepeatCurrent
source: Repeat current media
ja_jp: 現在のメディアをリピート
ko_kr: 현재 미디어 반복

# TooltipRepeatPlaylist
source: Repeat playlist
ko_kr: 재생 목록 반복

# TooltipRepeatOff
source: Repeat off
ja_jp: リピート解除
ko_kr: 반복 끄기

# TooltipEnterFullscreen
source: Enter fullscreen (F)
ja_jp: 全画面に切り替え (Enter / F / F11)
ko_kr: 전체 화면으로 전환 (Enter / F / F11)

# TooltipExitFullscreen
source: Exit fullscreen (Esc)
ja_jp: 全画面を終了 (Esc / Enter / F / F11)
ko_kr: 전체 화면 종료 (Esc / Enter / F / F11)

# TooltipClose
source: Close app
ja_jp: アプリを閉じる ({0})
ko_kr: 앱 닫기 ({0})

# BrowserFilter.PlaceholderText
source: Filter by name
ja_jp: 名前でフィルター
ko_kr: 이름으로 필터

# WebDavFilter.PlaceholderText
source: Filter by name
ja_jp: 名前でフィルター
ko_kr: 이름으로 필터

# BrowserSort.Label
source: Sort by name
ja_jp: 名前順
ko_kr: 이름순

# WebDavSort.Label
source: Sort by name
ja_jp: 名前順
ko_kr: 이름순

# SortName
source: Sort by name
ja_jp: 名前順
ko_kr: 이름순

# SortNewest
source: Newest first
ja_jp: 新しい順
ko_kr: 최신순

# SortOldest
source: Oldest first
ja_jp: 古い順
ko_kr: 오래된순

# SaveScreenshot.Text
source: Save current frame…
ja_jp: 現在のフレームを保存…
ko_kr: 현재 프레임 저장…

# ScreenshotUnavailableTitle
source: Screenshot unavailable
ja_jp: 画面をキャプチャできません
ko_kr: 화면 캡처 불가

# ScreenshotUnavailableMessage
source: Open a video and start or pause playback before saving a frame.
ja_jp: 動画を再生または一時停止してからフレームを保存してください。
ko_kr: 영상이 재생 중이거나 일시 정지된 상태에서 캡처할 수 있습니다.

# ScreenshotErrorTitle
source: Screenshot error
ja_jp: 画面キャプチャエラー
ko_kr: 화면 캡처 오류

# PngImageFileType
source: PNG image
ja_jp: PNG画像
ko_kr: PNG 이미지

# StatusScreenshotSaved
source: Saved current frame to {0}
ja_jp: 現在のフレームを{0}に保存しました
ko_kr: {0}에 현재 프레임을 저장했습니다

# HelpMenu.Title
source: Help
ja_jp: ヘルプ
ko_kr: 도움말

# About.Text
source: About
ja_jp: バージョン情報
ko_kr: 정보

# AboutTitle
source: About AIMediaWorker
ja_jp: AIMediaWorker について
ko_kr: AIMediaWorker 정보

# AboutVersion
source: Version {0}
ja_jp: バージョン {0}
ko_kr: 버전 {0}

# AboutThirdPartyLicenses
source: Third-party licenses
ja_jp: サードパーティライセンス
ko_kr: 타사 라이선스

# SettingsAssociationsSection.Text
source: Associations
ja_jp: 関連付け
ko_kr: 연결

# FileAssociationsHeading.Text
source: File associations
ja_jp: ファイルの関連付け
ko_kr: 파일 연결

# FileAssociationsDescription.Text
source: Register AIMediaWorker with Windows, then choose the default app for each media extension. Registration also adds AIMediaWorker to Open with.
ja_jp: AIMediaWorkerをWindowsに登録してから、メディア拡張子ごとの既定のアプリを選択します。登録すると、右クリックの「プログラムから開く」にもAIMediaWorkerが表示されます。
ko_kr: AIMediaWorker를 Windows에 등록한 뒤 미디어 확장자별 기본 앱을 선택하세요. 등록하면 우클릭의 '연결 프로그램'에도 AIMediaWorker가 표시됩니다.

# RegisterAssociationsButton.Content
source: Register with Windows
ja_jp: Windowsにアプリを登録
ko_kr: Windows에 앱 등록

# UnregisterAndUnloadButton.Content
source: Unregister and unload DLLs
ja_jp: 登録解除してDLLを解放
ko_kr: 등록 해제 및 DLL 해제

# OpenDefaultAppsButton.Content
source: Open Windows default apps
ja_jp: Windowsの既定のアプリを開く
ko_kr: Windows 기본 앱 열기

# FileAssociationsPackagedStatus
source: The installed package has registered its supported extensions with Windows.
ja_jp: インストールパッケージが対応拡張子をWindowsに登録しました。
ko_kr: 설치 패키지에서 지원 확장자를 Windows에 등록했습니다.

# FileAssociationsRegisteredStatus
source: AIMediaWorker is registered as an available app for this user.
ja_jp: このユーザーの利用可能なアプリとして登録されています。
ko_kr: 이 사용자 계정의 연결 프로그램에 등록되어 있습니다.

# FileAssociationsNotRegisteredStatus
source: AIMediaWorker is not registered as an available app for this user yet.
ja_jp: このユーザーの利用可能なアプリとしてまだ登録されていません。
ko_kr: 아직 이 사용자 계정의 연결 프로그램에 등록되지 않았습니다.

# FileAssociationsRegisteredTitle
source: App registered
ja_jp: アプリを登録しました
ko_kr: 앱 등록 완료

# FileAssociationsRegisteredMessage
source: AIMediaWorker was registered for the selected extensions. You can now choose it from Open with or make it the default app.
ja_jp: 選択した拡張子にAIMediaWorkerを登録しました。「プログラムから開く」で選択するか、既定のアプリに設定できます。
ko_kr: 선택한 확장자에 AIMediaWorker를 등록했습니다. 이제 연결 프로그램에서 선택하거나 기본 앱으로 지정할 수 있습니다.

# FileAssociationsUnregisterTitle
source: Unregister and unload DLLs
ja_jp: 登録解除してDLLを解放
ko_kr: 등록 해제 및 DLL 해제

# FileAssociationsUnregisterConfirmation
source: Remove all Windows file-association registrations and exit AIMediaWorker. Exiting fully unloads libmpv and its related DLLs. Unsaved subtitles will be checked before closing.
ja_jp: Windowsのファイル関連付け登録をすべて解除し、AIMediaWorkerを終了します。終了するとlibmpvと関連DLLが完全に解放されます。未保存の字幕がある場合は終了前に確認します。
ko_kr: Windows 파일 연결 등록을 모두 해제하고 AIMediaWorker를 종료합니다. 앱이 종료되면 libmpv와 관련 DLL이 완전히 해제됩니다. 저장하지 않은 자막이 있으면 종료 전에 확인합니다.

# UnregisterAndExitButton
source: Unregister and exit
ja_jp: 登録解除して終了
ko_kr: 해제하고 종료

# FileAssociationsUnregisteredTitle
source: App unregistered
ja_jp: アプリの登録を解除しました
ko_kr: 앱 등록 해제 완료

# FileAssociationsUnregisteredMessage
source: File-association registrations were removed. AIMediaWorker will now exit to unload its DLLs.
ja_jp: ファイル関連付けの登録を解除しました。DLLを解放するためAIMediaWorkerを終了します。
ko_kr: 파일 연결 등록을 해제했습니다. AIMediaWorker를 종료하여 DLL을 해제합니다.

# FileAssociationsErrorTitle
source: File association error
ja_jp: ファイルの関連付けエラー
ko_kr: 파일 연결 오류

# FileAssociationsSelectionRequiredMessage
source: Select at least one extension.
ja_jp: 拡張子を1つ以上選択してください。
ko_kr: 하나 이상의 확장자를 선택하세요.

# DefaultAppsOpenFailedMessage
source: Windows Default apps settings could not be opened.
ja_jp: Windowsの既定のアプリ設定を開けませんでした。
ko_kr: Windows 기본 앱 설정을 열 수 없습니다.

# AsrInstallationHeading.Text
source: ASR installation
ja_jp: 音声認識のインストール
ko_kr: 자동 음성 인식 설치

# AsrInstallationDescription.Text
source: Checks the bundled CrispASR native runtime and downloads the Qwen3 GGUF models to asr-worker\models below the executable. Existing components are skipped.
ja_jp: PATHにFFmpegがない場合のみ実行ファイル下のasr-workerにFFmpegをインストールし、CrispASRランタイムとQwen3 GGUFモデルを準備します。インストール済みの項目はスキップします。
ko_kr: PATH에 FFmpeg가 없을 때만 실행 파일 아래 asr-worker에 FFmpeg를 설치하고 CrispASR native runtime을 설치한 뒤 asr-worker\models에 Qwen3 GGUF 모델을 다운로드합니다. 이미 설치된 항목은 건너뜁니다.

# InstallAsrButton.Content
source: Install
ja_jp: インストール
ko_kr: 설치

# AsrInstallStartingMessage
source: Checking the ASR installation…
ja_jp: 音声認識のインストール状態を確認中…
ko_kr: 자동 음성 인식 설치 상태 확인 중…

# AsrInstallRuntimeMessage
source: Checking the CrispASR runtime: {0}
ja_jp: CrispASRランタイムを確認中: {0}
ko_kr: CrispASR 런타임 확인 중: {0}

# AsrInstallRuntimeSkippedMessage
source: CrispASR runtime already available — skipped
ja_jp: CrispASRランタイムは準備済みのためスキップ
ko_kr: CrispASR 런타임이 이미 있어 건너뜀

# AsrInstallRuntimeCompleteMessage
source: CrispASR runtime is ready
ja_jp: CrispASRランタイムの準備が完了しました
ko_kr: CrispASR 런타임 준비 완료

# AsrInstallRequirementsMessage
source: Installing requirements: {0}
ja_jp: 必須パッケージをインストール中: {0}
ko_kr: 필수 패키지 설치 중: {0}

# AsrInstallRequirementsSkippedMessage
source: Requirements already installed — skipped
ja_jp: {0}はインストール済みのためスキップ
ko_kr: {0}이(가) 이미 설치되어 건너뜀

# AsrInstallRequirementsCompleteMessage
source: Requirements installed
ja_jp: 必須パッケージをインストールしました
ko_kr: 필수 패키지 설치 완료

# AsrInstallModelMessage
source: Downloading {0}: {1}
ja_jp: {0}をダウンロード中: {1}
ko_kr: {0} 다운로드 중: {1}

# AsrInstallModelSkippedMessage
source: Already downloaded — skipped: {0}
ja_jp: ダウンロード済みのためスキップ: {0}
ko_kr: 이미 다운로드되어 건너뜀: {0}

# AsrInstallCompleteMessage
source: ASR installation complete
ja_jp: 音声認識のインストールが完了しました
ko_kr: 자동 음성 인식 설치 완료

# AsrInstallCompleteTitle
source: ASR is ready
ja_jp: 音声認識の準備完了
ko_kr: 자동 음성 인식 사용 준비 완료

# AsrInstallCompleteDetail
source: The CrispASR runtime and models are ready in {0}.
ja_jp: {0}にCrispASRランタイムとモデルを準備しました。
ko_kr: {0}에 CrispASR 런타임과 모델을 준비했습니다.

# AsrInstallCancelledMessage
source: ASR installation cancelled
ja_jp: 音声認識のインストールをキャンセルしました
ko_kr: 자동 음성 인식 설치를 취소했습니다

# AsrInstallFailedMessage
source: ASR installation failed
ja_jp: 音声認識のインストールに失敗しました
ko_kr: 자동 음성 인식 설치 실패

# AsrInstallFailedTitle
source: ASR installation error
ja_jp: 音声認識のインストールエラー
ko_kr: 자동 음성 인식 설치 오류

# AsrInstallRequiredTitle
source: ASR is not installed
ja_jp: 音声認識がインストールされていません
ko_kr: 자동 음성 인식이 설치되지 않음

# AsrInstallRequiredMessage
source: Choose Install under Automatic speech recognition in Preferences first.
ja_jp: 環境設定の音声認識でインストールを先に実行してください。
ko_kr: 환경 설정의 자동 음성 인식에서 설치 버튼을 먼저 누르세요.
